[
    {
        "carname":"honda city",
        "carbrand":"Honda",
        "mileage":25,
        "average":20,
        "fuel":"Petrol/CNG",
        "price":1500000,
        "description":"The Honda City Turbo was introduced in September 1982. It was powered by a turbocharged version of the 1231 cc Honda ER engine. A Pininfarina designed drop-top Cabriolet utilized the wider fenders and bigger bumpers of the Turbo II Bulldog, but was only available with the naturally aspirated 67 PS (49 kW) engine. There was also a Pro-series of van versions with either two or four seats. A high-roof 'R Manhattan Roof' version with a 10 centimetres (3.9 in) taller roof also appeared.",
        "modelyear":2020,
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/1056x660/n/cw/ec/134287/city-exterior-right-front-three-quarter-74.jpeg?isig=0&q=80"
    },
    {
        "carname":"Grand I10",
        "carbrand":"Hyundai",
        "mileage":45,
        "average":50,
        "fuel":"Petrol/CNG",
        "price":600000,
        "description":"The Hyundai i10 is a city car produced by the South Korean manufacturer Hyundai since 2007. It replaced the Hyundai Atos in the model line-up, and was initially available only as a five-door hatchback body style. The third generation i10 was unveiled in India on 7 August 2019 and launched on 20 August 2019, offered in 10 variants across petrol and diesel engines as well as manual and automatic transmissions. There is also a sedan derivative, the Hyundai Xcent and the Hyundai Aura.",
        "modelyear":2022,
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/136183/grand-i10-nios-exterior-right-front-three-quarter-15.jpeg?isig=0&q=80"
    },
    {
        "carname":"Inova",
        "carbrand":"Toyota",
        "mileage":25,
        "average":20,
        "fuel":"deasel",
        "price":2000000,
        "description":"In September 2004, Toyota debuted the first-generation Innova (designated AN40 series) in Indonesia. It followed the 2003 introduction of the Avanza—the replacement for low-spec versions of the Kijang. Badged as the Kijang Innova, the first-generation Innova in Indonesia was marketed as the fifth-generation Kijang to maintain the lineage with the fourth-generation model. It also had a more upmarket positioning than the latter.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/1056x660/n/cw/ec/140833/innova-crysta-right-front-three-quarter.png?isig=0&q=80"
    },
    {
        "carname":"Wagonr",
        "carbrand":"Maruti Suzuki",
        "mileage":50,
        "average":45,
        "fuel":"Petrol/CNG",
        "price":700000,
        "description":"The Maruti Suzuki Wagon R (or WagonR) is a city car manufactured and marketed by Suzuki through its subsidiary Maruti Suzuki primarily for the Indian market since 1999. The Wagon R was launched in India on 18 December 1999, and has since undergone several upgrades. The second-generation Wagon R model and styling was also shared with the Karimun Wagon R for the Indonesian market and the Wagon R for the Pakistani market, despite several differences.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/1056x660/n/cw/ec/112947/wagon-r-exterior-right-front-three-quarter-4.jpeg?isig=0&q=80"
    },
    {
        "carname":"Creta",
        "carbrand":"Hyundai",
        "mileage":30,
        "average":32,
        "fuel":"Petrol/CNG",
        "price":1500000,
        "description":"The Hyundai Creta, also known as Hyundai ix25 in China, is a subcompact crossover SUV produced by Hyundai since 2014 mainly for emerging markets, particularly BRICS. It is positioned above the Venue and below the Tucson in Hyundai's SUV line-up.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/106815/creta-exterior-right-front-three-quarter-4.png?isig=0&q=80"
    },
    {
        "carname":"Duster",
        "carbrand":"Ranault",
        "mileage":30,
        "average":20,
        "fuel":"Petrol/CNG",
        "price":4000000,
        "description":"The Dacia Duster is a family of automobiles produced and marketed jointly by the French manufacturer Renault and its Romanian subsidiary Dacia since 2010. It is currently in its third generation, It is marketed as the Renault Duster in certain markets such as Latin America, Russia, Ukraine, Asia, the Middle East, South Africa, and New Zealand.[1] The first generation was rebadged and restyled as the Nissan Terrano in CIS countries and India.[2] It was introduced in March 2010, and is the third model of the Dacia brand based on the Logan platform, after the Sandero.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/163875/new-duster-left-front-three-quarter.jpeg?isig=0&q=80"
    },
    {
        "carname":"Tata Tiago",
        "carbrand":"Tata",
        "mileage":50,
        "average":60,
        "fuel":"Petrol/CNG",
        "price":2000000,
        "description":"The Tata Tiago was created as the successor of the previous Tata Bolt, which was not met with much success. Tata began designing a completely new vehicle (Kite project) of a city car with 5-door body that could boost the sales of the brand in the Indian automotive market.",
        "avalability":true,
        "img":""
    },
    {
        "carname":"Ben-Z GLA",
        "carbrand":"Mercedes-Benz",
        "mileage":30,
        "average":20,
        "fuel":"Petrol/CNG",
        "price":8000000,
        "description":"The Mercedes-Benz GLA is a subcompact luxury crossover SUV manufactured and marketed by Mercedes-Benz over two generations. It is essentially the SUV equivalent of the A-Class, and the smallest SUV marketed by the brand.[2][3] The production version was revealed in August 2013 ahead of the 2013 Frankfurt Auto Show in September 2013.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/169159/gla-facelift-exterior-right-front-three-quarter-2.jpeg?isig=0&q=80"
    },
    {
        "carname":"Ford EcoSport",
        "carbrand":"Ford",
        "mileage":30,
        "average":30,
        "fuel":"Petrol/CNG",
        "price":5000000,
        "description":"The first-generation model was developed and built in Brazil by Ford Brazil since 2003, at the Camaçari plant. The second-generation model was launched in 2012, which was assembled in factories in India, Thailand, Russia and Romania.[2] The vehicle entered the North American market for the first time in 2018, until its discontinuation after the 2022 model year. Throughout its existence, the EcoSport shares its platform with the Fiesta.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/40369/ecosport-exterior-left-front-three-quarter.jpeg?q=80"
    },
    {
        "carname":"Tata Nexon",
        "carbrand":"Tata",
        "mileage":40,
        "average":30,
        "fuel":"Petrol/CNG",
        "price":2500000,
        "description":"The Nexon was presented as a production model in early 2016 and went on sale in 2017. It gained a battery electric version in late 2019, marketed as the Nexon EV.[3] In January 2020, the Nexon was refreshed with a heavily revised front and rear design.[4] In September 2023, a second facelift was presented.[5] By June 2024, Tata has produced 700,000 Nexons.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/40369/ecosport-exterior-left-front-three-quarter.jpeg?q=80"
    },
    {
        "carname":"Honda Civic",
        "carbrand":"Honda",
        "mileage":30,
        "average":20,
        "fuel":"Petrol/CNG",
        "price":1500000,
        "description":"The first-generation Civic was introduced in July 1972 as a two-door fastback sedan,[2] followed by a three-door hatchback that September. With a 1,169 cc transverse engine and front-wheel drive, the car provided good interior space despite overall small dimensions.[3] Initially gaining a reputation for being fuel-efficient, reliable and environmentally friendly, later iterations have become known for performance and sportiness, especially the Civic Type R, Civic VTi, Civic GTi and Civic SiR/Si.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/27074/civic-exterior-left-front-three-quarter.jpeg?q=80"
    },
    {
        "carname":"Mahindra XUV 3XO",
        "carbrand":"Mahindra",
        "mileage":30,
        "average":10,
        "fuel":"Petrol/CNG",
        "price":3000000,
        "description":"The Mahindra XUV300 is a subcompact crossover SUV produced by the Indian automaker Mahindra & Mahindra. It is based on the X100 platform of SsangYong Tivoli and has been sold in the Indian market since February 2019. Mahindra slotted it in the segment along with their Bolero Neo (formerly called the TUV300) to rival the Maruti Suzuki Vitara Brezza, Tata Nexon and the Ford EcoSport.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/156405/xuv-3xo-exterior-left-front-three-quarter-33.jpeg?isig=0&q=80"
    },
    {
        "carname":"BMW 2 Series Gran Coupe",
        "carbrand":"BMW",
        "mileage":15,
        "average":10,
        "fuel":"Petrol/CNG",
        "price":6000000,
        "description":"The BMW 2 Series Gran Coupé (model code F44) is a subcompact executive sedan produced by BMW.[2][3] It was revealed on 16 October 2019, and officially premiered at the 2019 Los Angeles Auto Show in November.[4] It was launched in worldwide markets in March 2020.[5] For most markets, the 2 Series Gran Coupé is the smallest four-door sedan offered by BMW, except in China and Mexico where the F52 1 Series sedan was offered.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/48034/2-series-gran-coupe-exterior-left-front-three-quarter.jpeg?q=80"
    },
    {
        "carname":"Toyota Glanza",
        "carbrand":"Toyota",
        "mileage":30,
        "average":40,
        "fuel":"Petrol/CNG",
        "price":2000000,
        "description":"The car was officially unveiled first to the public at the 66th IAA Frankfurt Motor Show on 15 September 2015.[11] It was previewed by the iK-2 concept car that was first shown at the 85th Geneva Motor Show in March 2015.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/112839/glanza-exterior-right-front-three-quarter-5.jpeg?isig=0&q=80"
    },
    {
        "carname":"Toyota Fortuner",
        "carbrand":"Toyota",
        "mileage":30,
        "average":10,
        "fuel":"Petrol/CNG",
        "price":3500000,
        "description":"The Toyota Fortuner, also known as the Toyota SW4, is a mid-size SUV manufactured by the Japanese automaker Toyota since 2004. Built on the Hilux pickup truck platform, it features two/three rows of seats and is available in either rear-wheel drive or four-wheel drive configuration. It is a part of Toyota's IMV project for emerging markets, which also includes the Hilux and the Innova.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/44709/fortuner-exterior-left-front-three-quarter.jpeg?q=80"
    },
    {
        "carname":"Hyundai Alcazar",
        "carbrand":"Hyundai",
        "mileage":30,
        "average":40,
        "fuel":"Petrol/CNG",
        "price":1000000,
        "description":"The Alcazar was first unveiled in April 2021,[9] and was released to the market in June 2021.[10] It is based on the Creta, with a 150 mm (5.9 in) longer wheelbase at 2,760 mm (108.7 in), and a longer overall body by 200 mm (7.9 in).[11] The longer body allows for a three-row seating, with 7-seater and 6-seater (with captain seats) options being offered.[12] The vehicle is also introduced with a reworked front styling, and a larger 18-inch wheels.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/158925/alcazar-facelift-right-front-three-quarter-3.jpeg?isig=0&q=80"
    },
    {
        "carname":"Benz A-Class Limousine",
        "carbrand":"Mercedes-Benz",
        "mileage":30,
        "average":40,
        "fuel":"Petrol/CNG",
        "price":4800000,
        "description":"Mercedes-Benz A-Class Limousine price in India goes from ₹ 46.05 - 48.55 Lakh in India.Mercedes A-Class Limousine being a Sedan comes in 2 variants.The base model of Mercedes-Benz A-Class Limousine - 200 starts at ₹ 46.05 Lakh in Delhi and the top model of Mercedes-Benz A-Class Limousine - 200d is priced at ₹ 48.55 Lakh in Delhi. If you are looking for a 5 seater car then you should consider A-Class Limousine.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/149525/a-class-limousine-exterior-right-front-three-quarter-7.jpeg?isig=0&q=80"
    },
    {
        "carname":"Audi Q3",
        "carbrand":"Audi",
        "mileage":30,
        "average":40,
        "fuel":"Petrol/CNG",
        "price":2200000,
        "description":"Designed by Julian Hoenig in 2006, it was a concept vehicle with Liquid Silver body colour, 20-inch wheels, fabric folding roof, electrically controlled hood, 4-cylinder 2.0 TDI engine rated at 204 PS (150 kW; 201 hp) and 400 N⋅m (295.02 lbf⋅ft), diesel particulate filter and Bluetec emission control system, quattro permanent four-wheel drive system with Haldex clutch, Audi S tronic dual-clutch gearbox, MacPherson strut front axle and a four-link rear axle, Audi drive select system with 3 modes (dynamic, sport, efficiency), MMI control panel with touch pad and dual-view technology, sound system with the prominent extending tweeters.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/28379/q3-exterior-right-front-three-quarter-93481.jpeg?isig=0&q=80"
    },
    {
        "carname":"Maruti Suzuki S-Presso",
        "carbrand":"Maruti Suzuki",
        "mileage":30,
        "average":40,
        "fuel":"Petrol/CNG",
        "price":700000,
        "description":"The Suzuki S-Presso is a city car produced by Maruti Suzuki, Suzuki's subsidiary in India since 2019. It slots above the Alto and below the Wagon R in the Indian market. The car is marketed as a micro SUV or a mini crossover by its rugged styling and high ground clearance of 180 mm (7.1 in).[2] The S-Presso is built on the HEARTECT platform derived from Suzuki's kei cars and uses 40% high tensile steel.[3][4] It is exported to several emerging markets in Africa, South Asia, Southeast Asia, Latin America, and the Middle East.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/126463/s-presso-exterior-right-front-three-quarter-3.jpeg?isig=0&q=80"
    },
    {
        "carname":"MG Astor",
        "carbrand":"MG",
        "mileage":30,
        "average":20,
        "fuel":"Petrol/CNG",
        "price":3500000,
        "description":"The MG ZS is a subcompact crossover SUV produced by the Chinese automotive manufacturer SAIC Motor under the British MG marque. Announced at the 2016 Guangzhou Auto Show in China, the MG ZS is the second SUV to be produced under the MG marque after the MG GS. It is positioned below the larger HS, and above the smaller MG 3 hatchback.[1] Since 2018, the ZS is available with a battery electric version called the ZS EV or EZS in China.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/103827/astor-right-front-three-quarter-2.jpeg?isig=0&q=80"
    },
    {
        "carname":"Scoda Slavia",
        "carbrand":"Scoda",
        "mileage":20,
        "average":25,
        "fuel":"Petrol/CNG",
        "price":1800000,
        "description":"The Škoda Slavia is a subcompact sedan (B-segment) manufactured by Škoda primarily for the Indian market. It was introduced in November 2021 and has been produced since 2022. Built on the MQB A0 IN platform adapted for India, the vehicle is based on the Volkswagen Virtus sedan.[1] The Slavia replaced the Volkswagen Polo-based Rapid",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/175951/slavia-exterior-right-front-three-quarter-5.jpeg?isig=0&q=80"
    },
    {
        "carname":"Tata Tigor",
        "carbrand":"Tata",
        "mileage":30,
        "average":40,
        "fuel":"Petrol/CNG",
        "price":800000,
        "description":"The Tata Tigor was born directly from the same project that originated the Tata Tiago[4] (internally called Kite 5) as it represents the four-door sedan version with a third rear volume. The Kite project was born in 2013 with the aim of developing two new compact cars, modern and inexpensive to offer on the Indian market in place of the Tata Zest and Bolt models that did not have the desired success as they were nothing but the profound restyling of the previous Indica Vista and Indigo Manza. In particular, Tigor replaces the Tata Zest.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/41160/tigor-exterior-left-front-three-quarter.jpeg?isig=0&q=80"
    },
    {
        "carname":"Mahindra Scorpio",
        "carbrand":"Mahindra",
        "mileage":30,
        "average":20,
        "fuel":"Petrol/CNG",
        "price":2800000,
        "description":"The Scorpio was conceptualized and designed by the in-house integrated design and manufacturing team of Mahindra & Mahindra. The car has been the recipient of three Indian awards, including the Car of the Year award from Business Standard Motoring as well as the Best SUV of the Year and the Best Car of the Year awards, both from BBC World's Wheels.",
        "avalability":true,
        "img":"https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/128413/scorpio-classic-exterior-left-front-three-quarter-2.jpeg?isig=0&q=80"
    }
]